# Data Importing and Data Preparation

In [33]:
# Dependencies and setup
import numpy as np
import pandas as pd
from pathlib import Path
import matplotlib.pyplot as plt
import seaborn as sns
import csv
from datetime import date

In [18]:
# defining data path
path=Path('Resources/Raw_data/testData.csv')

In [19]:
# Reading data source using pandas
rent_df=pd.read_csv(path)

ParserError: Error tokenizing data. C error: Expected 7 fields in line 172, saw 8

### Getting an error with 7 columns name but some rows have 8 columns. 
### Using CSV Reader to get the columns name and handaling this error so that can easily read with pandas

In [20]:
# Reading a csv file using CSV module for handaling error
with open(path, 'r') as f:
    csv_reader = csv.reader(f, delimiter=',')
    columns = next(csv_reader)
    print(columns)

['name', 'dob', 'houseID', 'houseZip', 'paymentDate', 'paymentAmount', 'rentAmount']

In [21]:
# Defining the columns name(adding new column name "extra")
names=columns+["extra"]

In [22]:
# Reading data source using pandas read_csv
rent_df=pd.read_csv(path, skiprows=1,names=names)

## Looking some information of the dataframe

In [23]:
#Looking top rows of rent_df dataframe
rent_df.head()

,name,dob,houseID,houseZip,paymentDate,paymentAmount,rentAmount,extra
0,Karima Germany,05/23/1951,1192,92154,11/01/2011,1321,1321.0,NaN
1,Agustina Spargo,01/01/1900,21,92111,20110906,2289,2289.0,NaN
2,Lucilla Broderick,01/01/1900,1474,92159,20111101,1439,1439.0,NaN
3,Russ Mchale,04/20/1977,2015,92137,20120701,1744,1744.0,NaN
4,Carmelita Ritzer,03/09/1969,311,92136,20110201,1471,1471.0,NaN

In [24]:
# Columns of rent_df dataframe
rent_df.columns

Index(['name', 'dob', 'houseID', 'houseZip', 'paymentDate', 'paymentAmount',
       'rentAmount', 'extra'],
      dtype='object')

In [ ]:
# Shape of rent_df datafrmae
shape=rent_df.shape
print(f'The number of rows are: {shape[0]}, number of columns are: {shape[1]}')

In [25]:
#Information of the dataframe using .info()
rent_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 59813 entries, 0 to 59812
Data columns (total 8 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   name           56903 non-null  object
 1   dob            59813 non-null  object
 2   houseID        59813 non-null  object
 3   houseZip       59813 non-null  int64
 4   paymentDate    59813 non-null  object
 5   paymentAmount  59281 non-null  object
 6   rentAmount     59775 non-null  float64
 7   extra          2910 non-null   float64
dtypes: float64(2), int64(1), object(5)
memory usage: 3.7+ MB

In [26]:
#looking for nan value
rent_df.isna().sum()

name              2910
dob                  0
houseID              0
houseZip             0
paymentDate          0
paymentAmount      532
rentAmount          38
extra            56903
dtype: int64

In [27]:
#filling NAN with 0 in extra column
rent_df['extra']=rent_df['extra'].fillna(0)
rent_df

,name,dob,houseID,houseZip,paymentDate,paymentAmount,rentAmount,extra
0,Karima Germany,05/23/1951,1192,92154,11/01/2011,1321,1321.0,0.0
1,Agustina Spargo,01/01/1900,21,92111,20110906,2289,2289.0,0.0
2,Lucilla Broderick,01/01/1900,1474,92159,20111101,1439,1439.0,0.0
3,Russ Mchale,04/20/1977,2015,92137,20120701,1744,1744.0,0.0
4,Carmelita Ritzer,03/09/1969,311,92136,20110201,1471,1471.0,0.0
...,...,...,...,...,...,...,...,...
59808,Jennell Buchholtz,05/21/1983,1095,92196,20101001,1744,1744.0,0.0
59809,Berneice Power,08/24/1984,196,92123,20100401,1756,1756.0,0.0
59810,Micki Belvin,01/01/1900,1692,92166,20120701,1896,1896.0,0.0
59811,Emilee Samford,01/01/1900,686,92191,20120528,1668,1451.0,0.0
59812,Astrid Laurence,05/15/1988,159,92120,01/01/2011,1134,1134.0,0.0

## Since some rows are shifted one column up, correcting this error using shift method.

In [28]:
#Get all rows by mask
mask = rent_df['extra'] != 0.0
#All columns name
c = list(rent_df.columns)
#Shift columns, by converting to strings
rent_df.loc[mask, c] = rent_df.loc[mask, c].astype(str).shift(-1, axis=1)

In [29]:
#Dropping the extra column after shifting rows correctly
rent_df.drop(columns="extra", axis=1, inplace=True)

In [30]:
#Looking top rows of  corrected rent_df dataframe
rent_df.head()

,name,dob,houseID,houseZip,paymentDate,paymentAmount,rentAmount
0,Karima Germany,05/23/1951,1192,92154,11/01/2011,1321,1321.0
1,Agustina Spargo,01/01/1900,21,92111,20110906,2289,2289.0
2,Lucilla Broderick,01/01/1900,1474,92159,20111101,1439,1439.0
3,Russ Mchale,04/20/1977,2015,92137,20120701,1744,1744.0
4,Carmelita Ritzer,03/09/1969,311,92136,20110201,1471,1471.0

## Converting column to appropriate datatypes

In [31]:
#Converting column to appropriate datatypes
rent_df['dob']=pd.to_datetime(rent_df['dob']).dt.date
rent_df['paymentDate']=pd.to_datetime(rent_df['paymentDate']).dt.date
rent_df['houseID']=rent_df['houseID'].astype('int')
rent_df['paymentAmount']=rent_df['paymentAmount'].astype('float')
rent_df['rentAmount']=rent_df['rentAmount'].astype('float')

In [34]:
#Adding the age columns using date of birth
rent_df["age"] = rent_df["dob"].apply(lambda x : (date.today().year - x.year))

In [35]:
#filling NAN with 0 in paymentAmount column
rent_df['paymentAmount']=rent_df['paymentAmount'].fillna(0)

In [36]:
# Shape of rent_df datafrmae
shape=rent_df.shape
print(f'The number of rows are: {shape[0]}, number of columns are: {shape[1]}')

The number of rows are: 59813, number of columns are: 8

In [37]:
#Info of the corrected dataframe
rent_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 59813 entries, 0 to 59812
Data columns (total 8 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   name           59813 non-null  object
 1   dob            59813 non-null  object
 2   houseID        59813 non-null  int64
 3   houseZip       59813 non-null  object
 4   paymentDate    59813 non-null  object
 5   paymentAmount  59813 non-null  float64
 6   rentAmount     59813 non-null  float64
 7   age            59813 non-null  int64
dtypes: float64(2), int64(2), object(4)
memory usage: 3.7+ MB

In [39]:
# looking for statistical terms(transpose for better visulization)
rent_df.describe().T

,count,mean,std,min,25%,50%,75%,max
houseID,59813.0,1236.777105,715.827165,1.0,610.0,1240.0,1860.0,2475.0
paymentAmount,59813.0,1497.364731,387.523757,-348.0,1310.0,1520.0,1736.0,2861.0
rentAmount,59813.0,1505.651330,303.685935,428.0,1310.0,1506.0,1720.0,2647.0
age,59813.0,82.674268,40.686114,-8.0,43.0,85.0,122.0,122.0

In [40]:
# Cleaned dataframe
rent_df.head(20)

,name,dob,houseID,houseZip,paymentDate,paymentAmount,rentAmount,age
0,Karima Germany,1951-05-23,1192,92154,2011-11-01,1321.0,1321.0,71
1,Agustina Spargo,1900-01-01,21,92111,2011-09-06,2289.0,2289.0,122
2,Lucilla Broderick,1900-01-01,1474,92159,2011-11-01,1439.0,1439.0,122
3,Russ Mchale,1977-04-20,2015,92137,2012-07-01,1744.0,1744.0,45
4,Carmelita Ritzer,1969-03-09,311,92136,2011-02-01,1471.0,1471.0,53
5,Clifton Ellwood,1993-11-02,430,92103,2011-11-01,1233.0,1233.0,29
6,Theda Howard,1900-01-01,2260,92161,2011-09-01,1850.0,1850.0,122
7,Delmar Facey,1900-01-01,541,92161,2011-12-01,1587.0,1587.0,122
8,Lashawn Rotella,1985-12-05,1336,92190,2011-07-01,1930.0,1930.0,37
9,Tianna Greenwell,1983-01-14,2273,92190,2010-05-01,1597.0,1597.0,39
10,Jillian Xu,1981-11-19,1115,92177,2010-05-08,1320.0,1320.0,41
11,Taneka Noto,1992-05-09,2216,92110,2011-03-01,988.0,988.0,30
12,Santo Hanney,1900-01-01,2052,92174,2012-07-01,1750.0,1750.0,122
13,Betsey Son,1980-08-15,205,92162,2012-08-01,1560.0,1560.0,42
14,Curtis Sher,1996-10-14,463,92130,2010-09-01,1169.0,1169.0,26
15,Britni Friel,1981-03-17,247,92195,2010-02-01,1370.0,1370.0,41
16,Claretta Carasco,1964-11-25,409,92170,2011-04-11,1698.0,1544.0,58
17,Kasi Kilgo,1900-01-01,1209,92132,2011-06-01,1539.0,1539.0,122
18,Harland Liggins,1983-11-28,910,92194,2011-02-01,1978.0,1978.0,39
19,Sonny Hayslip,1982-08-26,2160,92168,2012-04-08,1531.0,1531.0,40

## Missing date of birth is with 1900-01-01. Need to remove missing data for visulization or modeling.

In [48]:
# Looking for rows with date of birth 1900-01-01
rent_df.loc[rent_df["dob"].apply(lambda x : x.year)==1900, ['dob', 'age']]

              dob  age
1      1900-01-01  122
2      1900-01-01  122
6      1900-01-01  122
7      1900-01-01  122
12     1900-01-01  122
...           ...  ...
59800  1900-01-01  122
59802  1900-01-01  122
59806  1900-01-01  122
59810  1900-01-01  122
59811  1900-01-01  122

[29869 rows x 2 columns]

In [56]:
rent_df[(rent_df['age']>1) & (rent_df['age']<100)]

,name,dob,houseID,houseZip,paymentDate,paymentAmount,rentAmount,age
0,Karima Germany,1951-05-23,1192,92154,2011-11-01,1321.0,1321.0,71
3,Russ Mchale,1977-04-20,2015,92137,2012-07-01,1744.0,1744.0,45
4,Carmelita Ritzer,1969-03-09,311,92136,2011-02-01,1471.0,1471.0,53
5,Clifton Ellwood,1993-11-02,430,92103,2011-11-01,1233.0,1233.0,29
8,Lashawn Rotella,1985-12-05,1336,92190,2011-07-01,1930.0,1930.0,37
...,...,...,...,...,...,...,...,...
59805,Freddie Bridger,1965-03-06,804,92145,2011-04-01,1142.0,1142.0,57
59807,Marylouise Mott,1994-03-21,1633,92159,2010-07-01,1342.0,1342.0,28
59808,Jennell Buchholtz,1983-05-21,1095,92196,2010-10-01,1744.0,1744.0,39
59809,Berneice Power,1984-08-24,196,92123,2010-04-01,1756.0,1756.0,38
59812,Astrid Laurence,1988-05-15,159,92120,2011-01-01,1134.0,1134.0,34

In [ ]:
## 29869 rows are missing date of birth
## Will remove the missing date of birth later

## Saving the cleaned data for visualization and modeling

In [52]:
#saving the data f
rent_df.to_csv('Resources/Cleaned_data/cleaned_rent_data.csv', index=False)